## Plan Result (Aks_sbox - DeployInfrastructure)




<pre><code>Plan: 10 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_resource_group.disks_resource_group
  * azurerm_role_assignment.disk
  * module.kubernetes[&#34;01&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;msnode&#34;]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.update_checker[0]
* Update
  * azapi_resource.managedCluster[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.managedCluster[0] will be updated in-place
  ~ resource "azapi_resource" "managedCluster" {
        id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-rg/providers/Microsoft.ContainerService/managedClusters/ss-sbox-01-aks"
        name                      = "ss-sbox-01-aks"
      ~ output                    = jsonencode({}) -> (known after apply)
      - tags                      = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.disks_resource_group will be created
  + resource "azurerm_resource_group" "disks_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "disks-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # azurerm_role_assignment.disk will be created
  + resource "azurerm_role_assignment" "disk" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ba206872-8722-4375-bf4d-a28c39dff414"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azapi_resource.service_operator_credential will be created
  + resource "azapi_resource" "service_operator_credential" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "ss-sbox-01-aks"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi"
      + removing_special_chars    = false
      + schema_validation_enabled = false
      + tags                      = (known after apply)
      + type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview"
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = false
      + cost_analysis_enabled               = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "k8s-ss-sbox-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + location                            = "uksouth"
      + name                                = "ss-sbox-01-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "ss-sbox-01-aks-node-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "ss-sbox-01-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workload_identity_enabled           = true

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              + (sensitive value),
            ]
          + azure_rbac_enabled     = false
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled         = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 50
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.30"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "application"  = "core"
              + "autoShutdown" = "true"
              + "builtFrom"    = "hmcts/aks-sds-deploy"
              + "businessArea" = "Cross-Cutting"
              + "criticality"  = "Low"
              + "environment"  = "sandbox"
              + "expiresAfter" = "3000-01-01"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D4ds_v5"
          + vnet_subnet_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01"
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
            ]

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "33%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-sbox-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + kubelet_identity {
          + client_id                 = "3fbb7e58-9568-44b9-a847-34df64335854"
          + object_id                 = "fd657beb-8e34-42f2-9cc7-f9016a065849"
          + user_assigned_identity_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-kubelet-sbox-mi"
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCqPFmlkJn9vCOklB9wOJEAr+h36naEvWCH2LP6wVMTnbWkgwwhRvtVGeFeDo5jhlTJGk8/RyCnuQpoKfvfYNqr/5fhr0xa7CNJhb2NdUmv8u811APXKaf8psElQz4LzFb6HBcKapkVB1DQwUCVREY+BCnXtBZ1v6V24TO9YbJASs/BaPgZQJLThVGNe24jV0zRWDAy1RElPT8P1wO4k5hoDXg4NRoQt5IxqcpTUncVGN705ggqLf96zS70fPVlhLL5L6yBv4/0y9t4uo7NR5mKwDIRlpyXONpFpMGzj0zWLm/HDQqZNrD4Ycs2UolJcBk+YlUXTV6VyrnpmyKoVGvlOW8IpJLASW8HalNeOWTw5WsbjpY8rCrgasO6lMC3tI7t8yqFHFJ+EAqYZtVJoLO+ag97QZADlm2vcvctSGCAr8hqwYfb2UqqlDTuX/H8USqelCNa5NJAH7IMF1p1M9n0ohvT91U3KdtUvgu/8psuIXD1iEDNKQ3gwManbeRQ79M="
            }
        }

      + maintenance_window_node_os {
          + duration   = 4
          + frequency  = "Daily"
          + interval   = 1
          + start_date = (known after apply)
          + start_time = "16:00"
          + utc_offset = "+00:00"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + auto_scaling_enabled    = true
      + fips_enabled            = false
      + host_encryption_enabled = false
      + id                      = (known after apply)
      + kubelet_disk_type       = (known after apply)
      + kubernetes_cluster_id   = (known after apply)
      + max_count               = 10
      + max_pods                = 30
      + min_count               = 0
      + mode                    = "User"
      + name                    = "cronjob"
      + node_count              = (known after apply)
      + node_labels             = (known after apply)
      + node_public_ip_enabled  = false
      + node_taints             = [
          + "dedicated=jobs:NoSchedule",
        ]
      + orchestrator_version    = "1.30"
      + os_disk_size_gb         = (known after apply)
      + os_disk_type            = "Ephemeral"
      + os_sku                  = (known after apply)
      + os_type                 = "Linux"
      + priority                = "Regular"
      + scale_down_mode         = "Delete"
      + spot_max_price          = -1
      + tags                    = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled       = false
      + vm_size                 = "Standard_D4ds_v5"
      + vnet_subnet_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01"
      + zones                   = [
          + "1",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + drain_timeout_in_minutes      = 0
          + max_surge                     = "33%"
          + node_soak_duration_in_minutes = 0
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + auto_scaling_enabled    = true
      + fips_enabled            = false
      + host_encryption_enabled = false
      + id                      = (known after apply)
      + kubelet_disk_type       = (known after apply)
      + kubernetes_cluster_id   = (known after apply)
      + max_count               = 10
      + max_pods                = 30
      + min_count               = 4
      + mode                    = "User"
      + name                    = "linux"
      + node_count              = (known after apply)
      + node_labels             = (known after apply)
      + node_public_ip_enabled  = false
      + node_taints             = []
      + orchestrator_version    = "1.30"
      + os_disk_size_gb         = (known after apply)
      + os_disk_type            = "Ephemeral"
      + os_sku                  = (known after apply)
      + os_type                 = "Linux"
      + priority                = "Regular"
      + scale_down_mode         = "Delete"
      + spot_max_price          = -1
      + tags                    = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled       = false
      + vm_size                 = "Standard_D4ds_v5"
      + vnet_subnet_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01"
      + zones                   = [
          + "1",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + drain_timeout_in_minutes      = 0
          + max_surge                     = "33%"
          + node_soak_duration_in_minutes = 0
        }
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["msnode"] will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      + auto_scaling_enabled    = true
      + fips_enabled            = false
      + host_encryption_enabled = false
      + id                      = (known after apply)
      + kubelet_disk_type       = (known after apply)
      + kubernetes_cluster_id   = (known after apply)
      + max_count               = 4
      + max_pods                = 30
      + min_count               = 2
      + mode                    = "User"
      + name                    = "msnode"
      + node_count              = (known after apply)
      + node_labels             = (known after apply)
      + node_public_ip_enabled  = false
      + node_taints             = [
          + "kubernetes.io/os=windows:NoSchedule",
        ]
      + orchestrator_version    = "1.30"
      + os_disk_size_gb         = (known after apply)
      + os_disk_type            = "Ephemeral"
      + os_sku                  = (known after apply)
      + os_type                 = "Windows"
      + priority                = "Regular"
      + scale_down_mode         = "Delete"
      + spot_max_price          = -1
      + tags                    = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + ultra_ssd_enabled       = false
      + vm_size                 = "Standard_D4ds_v5"
      + vnet_subnet_id          = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/aks-01"
      + zones                   = [
          + "1",
        ]

      + timeouts {
          + update = "180m"
        }

      + upgrade_settings {
          + drain_timeout_in_minutes      = 0
          + max_surge                     = "33%"
          + node_soak_duration_in_minutes = 0
        }

      + windows_profile {
          + outbound_nat_enabled = true
        }
    }

  # module.kubernetes["01"].azurerm_role_assignment.aks_auto_shutdown[0] will be created
  + resource "azurerm_role_assignment" "aks_auto_shutdown" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fd657beb-8e34-42f2-9cc7-f9016a065849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-01-aks-node-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ clusters = "00" -> "00 01"
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.disks_resource_group has been deleted
  - resource "azurerm_resource_group" "disks_resource_group" {
      - id         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/disks-sbox-rg" -> null
        name       = "disks-sbox-rg"
        tags       = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":658,"Program":"tfcmt","SHA1":"","Target":"Aks_sbox - DeployInfrastructure","Vars":{}} -->